
#characters
define me = Character("Я")
define v = Character("Владіміров Володимир Миколайович", color="#8B0000")
define k = Character("Кублій Лариса Іванівна", color="#FFD700")
define g = Character("Гагарін Олександр Олександрович", color="#FE2E9A")
define o = Character("Одногрупник", color="#008000")
define p = Character("Член приймальної комісії", color="#00BFFF")
define c = Character("Maxwell The Cat", color="#8B008B")
define d = Character("Дід Мороз", color="#DC143C")

#backgrounds
image tef = "bg/tef.jpg"
image doky = "bg/dokumenty.jpg"
image main = "bg/firstkorpus.jpg"
image accomodation = "bg/gurtojytok.jpg"
image outside = "bg/gurtoutside.jpg"
image subway = "bg/metro.jpg"
image vm = "bg/online.jpg"
image pm = "bg/poliana_morning.jpg"
image pn = "bg/poliana_night.jpg"
image pw = "bg/poliana_winter.jpg"
image pp = "bg/poliana_pisiyn.jpg"
image wc = "bg/toilet.jpg"
image square = "bg/znansquare.jpg"
image baddid = "bg/baddid.jpg"
image koridor_winter = "bg/koridortef.jpg"
image koridor = "bg/koridor_tef.jpg"
image lol = "bg/lol.jpg"
image cat = "bg/catend.jpg"
image victory = "bg/congratulations.jpg"

#gagarin
image gagarin = "gagarin/gagarin_classic.jpg"
image gagarin smile = "gagarin/gagarin_smile.jpg"

#vladimirov
image volodia = "volodia/vladimirov_classic.png"
image volodia late = "volodia/vladimirov_late.png"
image volodia smile = "volodia/vladimirov_smile.png"

#kublii
image kublii = "kublii/kublii_classic.png"
image kublii smile = "kublii/kublii_smile.png"

define points = 0

label start:

    play music "music/bg.mp3" fadein(2)

    "На початку літа я написав ЗНО. А це означає, що підходив час для мене обирати університет."
    "В мене ніколи не було улюбленого заняття окрім відеоігр, але я непогано знав математику і тому вирішив віддавати перевагу технічним спеціальностям."
    "Від багатьох своїх старших друзів в нашому містечку(а жив я у селі Гречаному, Дніпровського району), що приїжали додому на канікули,"
    "я чув, що КПІ найкращий ВНЗ в Україні для навчання на технічних спеціальностях."
    "Досконало вивчивши програми, я обрав для себе 121-шу спеціальність - 'Інженерія програмного забезпечення'."
    "Я хотів потрапити на Факультет Інформатики та Обчислювальної Техніки(ФІОТ) і дуже надіявся, що мені вистачить балів для цього, адже на мою спеціальність там великий конкурс."
    "Хоча я і був досить розумним хлопцем, але, на жаль, мені не вистачило декількох балів для токо, щоб потрапити на ФІОТ на бюджет."
    "А, оскільки моя сім'я не мала грошей на моє навчання, мені довелося поступати на мій другий пріорітет - Теплоенергетичний Факультет(ТЕФ)."
    menu:
        "Але вибір в мене все одно є: вступати до КПІ чи ні?"

        "Так! Звісно до КПІ!":
            pass

        "Ні, давай роздивимось інші варіанти.":
            jump ty_sho


    "Я обрав його, бо знайомі казали, що там дружня атмосфера і навчають майже теж саме. Тому я все одно був радий і очікував, що в мене буде веселе і цікаве навчання, сповнене яскравими моментами."

    "І ось тепер я стою тут..."
    scene subway
    with dissolve
    "...перед виходом зі станції метро 'Політехнічний Інститут'."
    "Щож, час рушати до 5-го корпусу, адже саме там знаходиться ТЕФ. Сьогодні я приїхав тільки подавати докумети, а заселення в гуртожиток відбудеться вже пізніше."
    "Цікаво, як вживу виглядає мій факультет? Зараз і побачимо, тут всього 3 хвилини пішки."

    scene tef
    with dissolve

    "Так ось ти який, Теплоенергетичний Факультет. Вперед, поки черга на подачу документів не велика."

    scene dokumenty
    with dissolve

    p "Добрий ранок! Прошу ваші документи"
    me "Вітаю! Тримайте, будь ласка"
    "Сподіваюсь, що я нічого зі списка документів не забув."

    scene tef
    with dissolve

    "Справа зроблена, залишилось чекати на поселення у гуртожиток. Але чому б мені зараз не прогулятись територією кампусу?"

    scene main
    with dissolve

    "Ох, перший корпус. От би всі корпуси були б такі ж красиві як і він."

    scene square
    with dissolve

    "А це площа знань. Тут знаходяться великий 7-ий корпус, а також бібліотека, де мені вже скоро треба буде взяти книжки."

    $ renpy.notify("Пройшов дейкий час...")

    scene outside
    with dissolve

    "Сьогодні 31-ше серпня, наш потік сьогодні заїжджає до гуртожитків."
    "Ось і мій гуртожиток №14. Подивимось яка кімната нам дісталася"

    scene accomodation
    with dissolve

    "ЙОПСІЛЬ МОПСІЛЬ. Оце так щастя. Але нічого, головне, щоб компанія була приємна, а кімнату облаштуємо."
    "Сьогодні ввечері велика зустріч студентів на Поляні, а завтра у мене будуть перші пари."
    "Не так довго залишилось до зустрічі на Поляні, тож піду туди."

    scene pn
    with dissolve

    "Ого, як багато людей. І всі п'ють. Може і я трошки вип'ю, але тільки трошки, бо завтра перші пари."

    $ renpy.notify("Наступного ранку")
    scene accomodation
    with dissolve
    "Вже час спішити на пари! Голова не болить - добре, що вчора не випив дуже багато."
    "Що, сьогодні є нульова пара на 6:50? Буває ж таке. Добре хоч, що встав раніше."

    scene pm
    with dissolve
    "Жах, як тут багато сміття після ночі. Сподіваюсь, що його приберуть."
    "Поспішу на першу пару. Це предмет Компоненти програмної інженерії, а викладач - Гагарін."

    scene gagarin
    with dissolve

    g "Еее, студенти, млєм, я вас всіх вітаю, млєм млєм, в нашому курсі, еее, ми будемо розгядати компоненти програмної інженерії."
    g "По-перше вам слід знати, ее, що для створення класного проекту, млєм, треба розуміти основи банального кібернитичного програмування, ее."
    g "Ну, як кажуть, е, я вас уже чомусь навчив, а тепер ви мене навчіть, млєм, млєм."
    me "А як же ми вас чомусь навчим, якщо це ви - викладач, а ми - першокурсники?"
    g "Тобто, ее, ти кажеш, що, ее, я це я викладач? Ее, це можливо резонна поправка, дякую, млєм, млєм."
    o "А ви знаєте, що таке Python?"
    g "Ее, ні, а нука розкажи."
    o "Це така мова програмування."
    scene gagarin smile
    g "ОГО, ее, оце так інсайдерська інфа, ось тобі 7 балів за сьогоднішнє заняття."

    scene koridor
    with dissolve

    "Фуф, це був досить цікавий викладач. Що там у нас далі? А, онлайн заняття по мат аналізу. Це означає, що можна повернутись у гуртожиток"
    "Ой, не треба було пити так багато чаю зранку. Щож тепер робити?"
    menu:
        "Сходити в туалет у корпусі чи повернутись у гуртожиток?"

        "Добігти до гуртожику":
            pass
        "Навіщо чекати, якщо можна сходити тут":
            jump maxwell

    scene accomodation
    with dissolve

    "Фух, встиг. Швиденько заходжу в гугл міт до Володимира Миколайовича."
    menu:
        "Хочеться пити, але вже 8:29. Чи витратити 2 хвилинки на чай?"

        "Так, пити - це дуже важливо. Мені так бабуся казала.":
            $ renpy.notify("Ви повернулись з чаєм в 8:31 і вас не пустили на пару")
            show volodia late:
                xalign 0.5 yalign 0.6
            pause
            jump vidrahovano

        "Ні, треба зайти прямо зараз, бо перше знайомство з викладачем":
            $ points += 1
            scene online
            with dissolve
            show volodia
            me "Добрий ранок!"
            v "Добрий ранок!"
            hide volodia
            show volodia late:
                xalign 0.5 yalign 0.6
            v "Все, 8:31 - закриваю вхід, більше ніхто не зайде"

    scene pp
    with dissolve
    $ renpy.notify("Перший семестр підходить к кінцю і вже час святкувати на поляні")
    "А де всі? Щось тут дивне посеред Поляни, а людей так мало. Ну нічого почекаю."
    menu:
        "До котрої будемо тусити?"

        "До ранку":
            $ renpy.notify("3 ранку")
            show didmoroz at left:
                yalign 0.6
            with fade
            "Ти хто в біса такий!! Геть від мене! АААА!"
            scene baddid
            "Вас прибив Дід Мороз з Поляни"
            pause
            with dissolve
        "До часу максимум і спатки":
            scene victory
            with dissolve
            "Вітаю! Ви вижили у першому семестрі! Тепер ви офіційно студент!"
            pause
    return

label ty_sho:
    "В сенсі не вступати до КПІ? Та як я міг таке подумати!! Все, не маю сил більше жити("
    scene lol
    with dissolve
    pause
    return

label maxwell:
    scene wc
    with dissolve
    "Виглядає не дуже приємно, але що поробиш... "
    show toiletcat
    show maxwell:
        xalign 0.5 yalign 0.5
    with dissolve
    "ОЙ ЩО ЦЕ... ААААА"

    scene cat
    pause

    return

label vidrahovano:
    scene lol
    "Вас відрахували("
    with dissolve
    pause
    return